---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.StartShortening
source: html/8c6e46cb-d574-f036-c5b2-d5eec3544c22.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.StartShortening Property

Cutback or extension at element curve start.

## Syntax (C#)
```csharp
public double StartShortening { get; }
```